w8_plot3d/redirect_error/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2024-11-09 Sat 15:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>stdout and stderr</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content">
<h1 class="title">stdout and stderr</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8d23b74">1. tldr</a></li>
<li><a href="#org5c395ff">2. 追記</a></li>
<li><a href="#org95b7356">3. command_line/global</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8d23b74" class="outline-2">
<h2 id="org8d23b74"><span class="section-number-2">1</span> tldr</h2>
<div class="outline-text-2" id="text-1">
<p>
commandからの出力にはstdin, stderrがある．
redirectでそれらを保存するには以下のようにする．
</p>
<div class="org-src-container">
<pre class="src src-bash">$ ruby file_dummy_task.rb               <span style="color: #b22222;"># </span><span style="color: #b22222;">normal</span>
$ ruby file_dummy_task.rb &gt; results.txt  <span style="color: #b22222;"># </span><span style="color: #b22222;">stdout to results.txt</span>
$ ruby file_dummy_task.rb 2 &gt; errors.txt <span style="color: #b22222;"># </span><span style="color: #b22222;">stderr only to errors.txt</span>
$ ruby file_dummy_task.rb &amp;&gt; results.txt <span style="color: #b22222;"># </span><span style="color: #b22222;">both stdout and stderr to results.txt</span>
$ ruby file_dummy_task.rb &gt; results.txt 2&gt; errors.txt 
               <span style="color: #b22222;"># </span><span style="color: #b22222;">stdout to results.txt, and stderr to errors.txt</span>
$ cat errors.txt
$ cat result.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c395ff" class="outline-2">
<h2 id="org5c395ff"><span class="section-number-2">2</span> 追記</h2>
<div class="outline-text-2" id="text-2">
<p>
ファイルに上書きするのではなく，追記するには　
</p>
<div class="org-src-container">
<pre class="src src-shell">$ ruby file_dummy_task.rb  &gt;&gt; results.txt
</pre>
</div>
<p>
すればよい．
</p>
</div>
</div>

<div id="outline-container-org95b7356" class="outline-2">
<h2 id="org95b7356"><span class="section-number-2">3</span> command_line/global</h2>
<div class="outline-text-2" id="text-3">
<p>
これらの操作をRubyから呼び出すには，
</p>
<div class="org-src-container">
<pre class="src src-shell">$ sudo gem install command_line
</pre>
</div>
<p>
したうえで，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #483d8b;">system</span> comm
</pre>
</div>
<p>
の代わりに，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #483d8b;">require</span> <span style="color: #8b2252;">'command_line/global'</span>
<span style="color: #483d8b;">require</span> <span style="color: #8b2252;">'colorize'</span>

results = command_line( comm )
<span style="color: #483d8b;">puts</span> results.stderr.red&#12288;
<span style="color: #483d8b;">puts</span> results.stdout.blue
</pre>
</div>
<p>
などとする．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2024-11-09 Sat 15:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
